sWahlinRhoades/uTaskerModified/Hardware/LPC17XX/LPC17XX_boot.c
#if defined (_GNU)
extern const VECTOR_TABLE_MINIMUM reset_vect;                            // {2}
volatile void *ptrTest;

extern unsigned char __data_start__, __data_end__;
extern const unsigned char __data_load_start__;
extern unsigned char __text_start__, __text_end__;
extern const unsigned char __text_load_start__;
extern unsigned char __bss_start__, __bss_end__;

extern void __init_gnu_data(void)
{
    unsigned char *ptrData = &__data_start__;
    const unsigned char *ptrFlash = &__data_load_start__;
    unsigned long ulInitDataLength = (&__data_end__ - &__data_start__);
    while (ulInitDataLength--) {                                         // initialise data
        *ptrData++ = *ptrFlash++;
    }

    ptrData = &__text_start__;
    ptrFlash = &__text_load_start__;
    if (ptrFlash != ptrData) {                                           // if a move is required
        ulInitDataLength = (&__text_end__ - &__text_start__);
        while (ulInitDataLength--) {                                     // initialise text
            *ptrData++ = *ptrFlash++;
        }
    }

    ptrData = &__bss_start__;
    ulInitDataLength = (&__bss_end__ - &__bss_start__);
    while (ulInitDataLength--) {                                         // initialise bss
        *ptrData++ = 0;
    }
}
#endif


// Perform very low level initialisation - called by the start up code
//
#if defined COMPILE_IAR
static void _LowLevelInit(void) @ "ICODE"
#else
static void _LowLevelInit(void)
#endif
{
#if defined _GNU
    ptrTest = (volatile void *)&reset_vect;                              // {2} force GCC to link the reset table
#endif 
    // Configure the PLL for the desired operating frequency - note the exact sequence is very important
    //
    if (PLL0STAT & PLLCONNECTED) {                                       // if PLL main is already connected (can be connected by ISP)
        PLL0CON  = PLLE;                                                 // disconnect PLL, but leave enabled
        PLL0FEED = 0xaa;PLL0FEED = 0x55;                                 // perform feed sequence so that register changes are accepted
    }
    PLL0CON  = 0;                                                        // disable PLL and disconnect
    PLL0FEED = 0xaa;PLL0FEED = 0x55;                                     // perform feed sequence so that register changes are accepted

    #if CRYSTAL_FREQ > 15000000
    SCS |= (OSCRANGE | OSCEN);                                           // enable the oscillator
    #else
    SCS |= (OSCEN);                                                      // enable the oscillator
    #endif
    #ifndef _WINDOWS
    while (!(SCS & OSCSTAT)) {}                                          // wait for it to stabilise
    #endif

    #if defined USE_RC_OSCILLATOR
    CLKSRCSEL = PLL_SOURCE_4M_RC;                                        // ensure RC source
    #elif defined USE_32K_OSCILLATOR
    CLKSRCSEL = PLL_SOURCE_RTC;                                          // RTC crystal as sourcey
    #else
    CLKSRCSEL = PLL_SOURCE_OSCILLATOR;                                   // oscillator as PLL clock source
    #endif
#ifndef DISABLE_PLL
    PLL0CFG = PLL_FREQUENCY_CONFIGURATION;                               // PLL setting to generate required frequency
    PLL0FEED = 0xaa;PLL0FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
    PLL0CON = PLLE;                                                      // enable the PLL to search for lock
    PLL0FEED = 0xaa;PLL0FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
    USBCLKCFG = USB_FREQUENCY_CONFIGURATION;                             // set 48MHz USB clock if needed
    CCLKCFG = CPU_CLOCK_CONFIGURATION;                                   // set CPU clock frequency from PLL output
    while (!(PLL0STAT & PLLLOCKED)) {                                    // wait for lock to be achieved
    #ifdef _WINDOWS
        PLL0STAT = (PLLLOCKED | PLL_FREQUENCY_CONFIGURATION);
    #endif
    }
    PLL0CON = (PLLE | PLLC);                                             // connect PLL to clock CPU
    PLL0FEED = 0xaa;PLL0FEED = 0x55;                                     // perform feed sequence so that register changes are accepted
#endif

    FLASHCFG = (FLASHCFG_FIXED | FLASH_CPU_CLOCKS);                      // set optimum FLASH wait states

    PCLKSEL0 = 0;                                                        // peripheral clocks set to default 1/4 speed
    PCLKSEL1 = 0;
    PINSEL0  = 0x00000000;                                               // set all pin states and ports to default
    PINSEL1  = 0x00000000;
    PINSEL2  = 0x00000000;
    PINSEL3  = 0x00000000;
    PINSEL4  = 0x00000000;
    PINSEL5  = 0x00000000;
    PINSEL6  = 0x00000000;
    PINSEL7  = 0x00000000;
    PINSEL8  = 0x00000000;
    PINSEL9  = 0x00000000;
    PINSEL10 = 0x00000000;
    FIO0DIR  = 0x00000000;
    FIO1DIR  = 0x00000000;
    FIO2DIR  = 0x00000000;
    FIO3DIR  = 0x00000000;
    FIO4DIR  = 0x00000000;
    FIO0MASK = 0x00000000;
    FIO1MASK = 0x00000000;
    FIO2MASK = 0x00000000;
    FIO3MASK = 0x00000000;
    FIO4MASK = 0x00000000;
                                                  // initialise variables
#if defined (_GNU)
    __init_gnu_data();
#endif
#ifndef _WINDOWS
    #ifdef COMPILE_IAR
    __iar_program_start();
    #else
    _main();                                                             // call boot code
    #endif
#endif
}

#if defined _COMPILE_KEIL
// Keil demands the use of a main function with int return value
//
extern int main(void)
{
    _LowLevelInit();
    return 0;
}
#else
// Allow the jump to a foreign application as if it were a reset (load SP and PC)
//
extern void start_application(unsigned long app_link_location)           // {1}
{
    #ifndef _WINDOWS
    asm(" ldr sp, [r0,#0]");
    asm(" ldr pc, [r0,#4]");
    #endif
}
#endif

// The initial stack pointer and PC value - this is linked at address 0x00000000
//
#if defined COMPILE_IAR5
__root const VECTOR_TABLE_MINIMUM __vector_table @ ".intvec"               // __root forces the function to be linked in IAR project
#elif defined COMPILE_IAR
__root const VECTOR_TABLE_MINIMUM reset_vect @ "RESETVECT"                 // __root forces the function to be linked in IAR project
#elif defined _GNU
const VECTOR_TABLE_MINIMUM __attribute__((section(".vectors"))) reset_vect
#elif defined _COMPILE_KEIL
__attribute__((section("RESET"))) const VECTOR_TABLE_MINIMUM reset_vect
#else
const VECTOR_TABLE_MINIMUM reset_vect
#endif
= {
    {
        (void *)(RAM_START_ADDRESS + SIZE_OF_RAM - IAP_STACK_SIZE - 4),  // stack pointer to top of RAM - leaving space for IAP and random number
        (void (*)(void))START_CODE,                                      // start address
    },
    0x53415475,                                                          // dummy vector values (for recognition)
    0x2052454b,
    0x3143504c,
    0x20585858,
    0x2e522e43,
#ifndef COMPILE_IAR5
    0xffffffff,                                                          // blank for check sum
#endif
};

    #if defined COMPILE_IAR5
    __root const unsigned long __vector_table_0x1c @ ".intvec" = 0xffffffff;
    #endif


